Strings
============

Redis에서 문자열 명령어들은 Redis의 문자열 값들을 관리하는데 사용됩니다. "Syntax"절에 나와있는 Redis 문자열 명령어들을 따라해보세요. 

## Syntax

Redis에서 문자열 조작 명령어들은 다음 형태로 구성됩니다.

```bash
redis:6379> <명령어> <KEY 이름> (<값..>)
```

## Example

Redis에서 문자열을 저장하고 가져와보겠습니다. 터미널에 다음을 입력해주세요.

```bash
# "tutorial" 키에 "REDIS"라는 값을 저장
redis:6379> SET tutorial REDIS
OK

# "tutorial"키에 저장된 값 반환
redis:6379> GET tutorial
"REDIS"
```

위는 "string" 타입에 대한 GET, SET 명령어의 예를 보여줍니다. 여기서 키는 "tutorial"입니다.


## Redis String sCommands

다음 테이블은 Redis에서 string 타입을 조작하기 위한 기초 명령어들을 보여줍니다.

| Sr.No | Command | Description |
| ----- | ------- | ----------- |
| 01 | SET key value | 이 명령어는 특정 키에 값을 설정합니다. |
| 02 | GET key | 키의 값을 가져옵니다. |
| 03 | GETRANGE key start end | 키에 저장된 문자열의 일부분을 가져옵니다. |
| 04 | GETSET key value | 키에 해당 값을 저장하고, 이전에 저장한 값을 반환합니다. |
| 05 | GETBIT key offset | 키에 저장된 문자열의 오프셋의 비트 값을 반환합니다. |
| 06 | MGET key1 [key2 ..] | 여러 키에 저장된 각 문자열들을 가져옵니다. |
| 07 | SETBIT key offset value | 키에 저장된 문자열 값에서 오프셋의 비트를 설정하거나 지웁니다. |
| 08 | SETEX key seconds value | 해당 키에 값을 seconds만큼 저장합니다.  |
| 09 | SETNX key value | 키가 존재하지 않을 때만, 키의 값을 저장합니다. |
| 10 | SETRANGE key offset value | 키에 저장된 문자열에서, 지정된 오프셋부터 값을 덮어씁니다. |
| 11 | STRLEN key | 키의 저장된 문자열의 길이를 불러옵니다. |
| 12 | MSET key value [key2 value2..] | 여러 키에 각 값을 저장합니다. |
| 13 | MSETNX  key value [key2 value2..] | 여러 키에, 존재하지 않은 키라면 각 값을 저장합니다. |
| 14 | PSETEX key ms value | ms동안만 키에 값을 저장합니다. |
| 15 | INCR key | 키에 저장된 값을 1 올립니다. |
| 16 | INCRBY key increment | 키에 저장된 값을 주어진 정수만큼 올립니다. |
| 17 | INCRFLOAT key increment | 키의 저장된 값을 주어진 실수만큼 올립니다. |
| 18 | DECR key | 키에 저장된 값을 1 내립니다. |
| 19 | DECRBY key decrement | 키에 저장된 값을 주어진 정수만큼 줄입니다. |
| 20 | APPEND key value | 키에 저장된 값에 value를 추가합니다. |


## SET key value 

Redis SET 커맨드는 특정 키에 string 타입의 값을 설정할 때 쓰입니다.

### Return Value

요청이 성공하면 "OK"라는 간단한 문자열을 응답 받습니다. 설정되지 않다면 "Null"이 반환됩니다.

### Syntax

SET 커맨드의 기본 구조는 다음과 같습니다.

```
redis:6379> SET <KEY NAME> <VALUE>
```

### Example

터미널에 다음을 입력해주세요

```bash
redis:6379> SET mykey myvalue
OK
```

### Options

SET 커맨드는 사용할 수 있는 다양한 옵션들이 있습니다. 다음 문법은 SET 커맨드의 다양한 옵션으 쓰는 것을 보여줍니다.

```
redis:6379> SET <KEY NAME> <VALUE> [EX seconds] [PX ms] [NX|XX]
```

* EX seconds - 저장 후 소멸 시간을 설정합니다. 단위는 초입니다.
* PX ms - 저장 후 소멸 시간을 설정합니다. 단위는 ms입니다.
* NX - 존재하지 않는 키에만 값을 설정합니다.
* XX - 존재하는 키에만 값을 설정합니다.

### Example

다음을 터미널에 입력해주세요.

```bash
redis:6379> SET mykey myvalue EX 60 NX
OK
```

이 예의 경우 mykey 라는 키의, myvalue 값을 저장합니다. 그러나 60초 후에 사라지며, mykey이라는 키가 저장되어 있지 않을 때만 동작합니다.


## GET key 

Redis의 GET 커맨드는 특정 키에 저장된 값을 가져올 때 사용합니다. 만약, 키가 존재하지 않는다면, "nil"을 반환하게 됩니다. string 타입의 값이 아닐 경우, 에러를 반환합니다.

### Return Value

간단한 문자열이 응답됩니다. 키에 저장된 값이나 "nil"이 반환됩니다.

### Syntax

다음 문법으로 GET 명령어를 사용할 수 있습니다.

```
redis:6379> GET <KEY NAME> 
```

### Example

먼저 키를 설정한 후, 값을 가져와보도록 하겠습니다. 터미널에 다음을 입력하세요.

```bash
# 문자열 저장
redis:6379> SET mykey myvalue
OK
# 문자열 가져오기
redis:6379> GET mykey
"myvalue"
```


## GETRANGE key start end 

Redis의 GETRANGE 명령어는 키에 저장된 문자열의 부분 문자열을 가져오기 위해서 사용합니다. 키와 함께 부분 문자열의 start, end 오프셋을 입력해야 합니다. Redis는 음수 offset을 제공하는데, 덕분에 우리는 저장된 문자열 끝에서부터 시작하여, 오프셋을 조작할 수 있습니다. (마치 파이썬처럼..)

### Return Value

간단한 문자열이 반환됩니다.

### Syntax

GETRANGE 커맨드는 다음 구조를 가집니다.

```
redis:6379> GETRANGE <KEY_NAME> <start> <end>
```

### Example

한 번 문자열을 저장한 후, 부분 문자열을 가져와보도록 하겠습니다. 터미널에 다음을 입력하세요,

```bash
# 문자열 저장
redis:6379> SET mykey "This is my test key"
OK
# 0~3까지 부분 문자열 가져오기 
redis:6379> GETRANGE mykey 0 3 
"This"
# 0~-1(끝)까지 부분 문자열 가져오기 
redis:6379> GETRANGE mykey 0 -1
"This is my test key"
```


## GETSET key value 

Redis의 GETSET 커맨드는 특정 키의 지정한 값을 저장하고, 그것의 옛 값을 반환합니다.

### Return Value

해당 키가 이전에 저장했던 값을 반환합니다. 만약, 키가 존재하지 않다면, "nil"이 반환됩니다.

### Syntax

GETSET 커맨드는 다음의 문법 구조를 지닙니다.

```
redis:6379> GETSET <KEY_NAME> <VALUE>
```

### Example

한 번 "mykey"라는 키에 GETSET을 2번 실행해보겠습니다. 터미널에 다음을 입력해주세요.

```bash
# GETSET 실행
redis:6379> GETSET mykey "This is my test key"
# 이전에 키가 없기 떄문에 nil
(nil)

# GETSET 실행
redis:6379> GETSET mykey "This is my new value to test getset"
# 이전 값 출력
"This is my test key"
```


## GETBIT key offset 

Redis GETBIT 커맨드는 키에 저장된 문자열의 오프셋에서 비트 값을 가져 오는데 사용됩니다.

### Return Value

정수가 반환되며, 이 정수는 offset에 저장된 비트 값입니다.

### Syntax

GETBIT 명령어는 다음과 같은 문법 구조를 가지고 있습니다.

```
radis:6379> GETBIT <KEY_NAME> <OFFSET>
```

### Example

```bash 
# mykey의 offset 7에 1bit 설정
redis:6379> SETBIT mykey 7 1 
(integer) 0 

# mykey의 offset 0을 가져옴. 기본 0
redis:6379> GETBIT mykey 0 
(integer) 0 

# mykey의 offset 7을 가져옴. 
redis:6379> GETBIT mykey 7 
(integer) 1 
redis:6379> GETBIT mykey 100
(integer) 0 
```


## MGET key1 [key2 ..] 

Redis의 MGET 명령어는 한번에 여러키의 값들을 가져올 때 사용됩니다. 문자열이 저장되어 있지 않거나, 존재하지 않은 키라면, "nil"이라는 특별한 값을 반환합니다.

### Return Value

특정 키들의 리스트를 반환합니다.

### Syntax

MGET 커맨드는 다음과 같은 문법 구조를 가지고 있습니다.

```
redis:6379> MGET <KEY1> <KEY2> ..
```

### Example

여러 키를 저장하고 한 번에 불러와보겠습니다. 터미널에 다음을 입력하세요.

```bash
redis:6379> SET key1 "hello"
OK
redis:6379> SET key2 "world"
OK
redis:6379> MGET key1 key2 key3
1) "hello"
2) "world"
3) (nil)
```

key1, key2를 저장하고 MGET으로 한 번에 불러옵니다. 그러나, key3는 저장되어 있지 않기 때문에, nil 이라는 값이 반환되게 됩니다.


## SETBIT key offset value 

Redis SETBIT 명령어는 키에 저장되니 문자열 값의 오프셋에 비트를 설정하는 데 사용됩니다.

### Return Value

정수형, 저장된 값의 오프셋을 반환합니다.

### Syntax

SETBIT 명령어는 다음 문법으로 사용할 수 있습니다.

```
redis:6379> SETBIT <KEY_NAME> <OFFSET>
```

### Example

터미널에 다음을 입력해주세요.

```bash 
# mykey의 offset 7에 1bit 설정
redis:6379> SETBIT mykey 7 1 
(integer) 0 

# mykey의 offset 0을 가져옴. 기본 0
redis:6379> GETBIT mykey 0 
(integer) 0 

# mykey의 offset 7을 가져옴. 
redis:6379> GETBIT mykey 7 
(integer) 1 
redis:6379> GETBIT mykey 100
(integer) 0 
```

위의 예는 GETBIT 명령어를 알아볼 때 사용한 예와 일치합니다. 이번에는 첫 줄 SETBIT 명령어에 유의해서 예제를 봐주시길 바랍니다.


## SETEX key seconds value 

Redis의 SETEX 명령어는 Redis키의 특정 시간 동안 유지되는, 값을 저장할 때 쓰입니다.

### Return Value

간단한 문자열이 응답됩니다. 만약, 키에 값이 설정된다면, OK, 값이 설정되지 않는다면 NULL이 반환됩니다.

### Syntax

SETEX는 다음과 같은 문법으로 사용할 수 있습니다.

```
redis:6379> SETEX <KEY_NAME> <TIMEOUT> <VALUE>
```

### Example

다음은 SETEX 명령어의 예입니다. 터미널에 다음을 입력해주세요.

```bash
# 60초 동안 "mykey"라는 키에 "redis"리는 값을 설정합니다.
redis:6379> SETEX mykey 60 redis
OK

# mykey의 유효 시간을 확인합니다.
redis:6379> TTL mykey
(integer) 56

# mykey의 값을 가져옵니다.
redis:6379> GET mykey
"redis"

# 약 1분 후 mykey의 값을 가져옵니다.
redis:6379> GET mykey
(nil)
```


## SETNX key value 

Redis SETNX 명령어는 Redis 존재하지 않는 키의 값을 지정하는데 사용됩니다. SETNX는 "SET if NOT eXist"의 줄임말입니다.

### Return Value

1 혹은 0 의 값이 응답됩니다.

* 키가 설정되었다면 1
* 키가 설정되지 않았다면 0

### Syntax

SETNX 명령어는 다음 문법 구조를 가집니다.

```
redis:6379> SETNX <KEY_NAME> <VALUE>
```

### Example

다음은 SETNX의 예입니다. 터미널에 다음을 입력해주세요.

```bash
# 값 설정 (성공)
redis:6379> SETNX mykey redis
(integer) 1

# 존재하는 키에 SETNX 시도 (실패)
redis:6379> SETNX mykey mongo
(integer) 0

# 값 확인
redis:6379> GET mykey
"redis"
```


## SETRANGE key offset value 

Redis의 SETRANGE 명령어는 인수로 받은 키에 저장된 문자열의 특정 오프셋 부터 입력 값을 덮어 쓰는 명령어입니다.

### Return Value

정수형이 응답되며, 명령어에 의해 수정된 문자열의 길이를 반환합니다.

### Syntax

SETRANGE 명령어는 다음의 문법으로 사용할 수 있습니다.

```
redis 6379> SETRANGE <KEY_NAME> <OFFSET> <VALUE>
```

### Example

```bash
# key 에 "Hello World" 설정 (길이 11)
redis:6379> SET key "Hello World"
OK

# key SETRANGE 실행 
redis:6379> SETRANGE key 6 "Redis!!"
# 문자열 길이 13 반환 ("Hello Redis!!")
(integer) 13

# 바뀐 값 불러옴
redis:6379> GET key
"Hello Redis!!"
```


## STRLEN key

Redis의 STRLEN 명령어는 키에 저장된 문자열 값의 길이를 얻기 위해서 사용합니다. 키의 문자열이 아닌 값이 저장되어 있다면, 에러를 반환합니다.

### Return Value

문자열의 길이가 반환됩니다. 키가 존재하지 않다면 0을 반환합니다.

### Syntax

STRLEN 명령어는 다음 문법으로 사용할 수 있습니다.

```
redis:6379> STRLEN <KEY_NAME>
```

### Example

터미널에 다음을 입력해주세요.

```bash
# key1에 "Hello World" 저장
redis:6379> SET key1 "Hello World"
OK
# key1에 저장된 문자열의 길이
redis:6379> STRLEN key1
(integer) 11

# key2(존재하지 않는 키)에 저장된 문자열의 길이
redis:6379> STRLEN key2
(integer) 0
```


## MSET key value [key2 value2..]

Redis의 MSET 명령어는 여러 키들의 값들을 한번에 저장하는데 사용합니다. 
 
### Return Value

OK라는 간단한 문자열이 응답됩니다.

### Syntax

MSET 명령어는 다음의 문법 구조를 가집니다.

```
redis:6379> MSET <key1> <value1> <key2> <value2> ..
```

### Example

터미널에 다음을 입력해주세요.

```bash
# key1에 "Hello", key2에 "Redis" 한 번에 저장
redis:6379> MSET key1 "Hello" key2 "Redis"
OK

# key1 불러오기
redis:6379> GET key1
"Hello"

# key3 불러오기
redis:6379> GET key2
"Redis"
```


## MSETNX  key value [key2 value2..]

Redis의 MSETNX 명령어는 여러 키의 여러 값을 저장하는데, 이미 존재하지 않은 키에서만 저장합니다. 명령어 실행 도중 이미 키가 하나라도 있다면, MSETNX는 실행되지 않습니다.

### Return Value

1 혹은 0이 반환됩니다.

* 레디스의 모든 키가 저장되었을 때 1이 반환됩니다.
* 레디스의 키들이 저장되지 않으면, 0이 반환됩니다.

### Syntax

MSETNX는 다음 문법으로 사용할 수 있습니다.

```
redis:6379 > MSETNX <key1> <value1> <key2> <value2> ...
```

### Example

터미널에 다음을 입력해주세요.

```bash
# 존재하지 않는 key1, key2 값 저장
redis:6379> MSETNX key1 "Hello" key2 "world"
# 성공
(integer) 1

# 존재하는 key2, 존재하지 않는 key3 갑 저장
redis:6379> MSETNX key2 "redus" key3 "mongo"
# 실패 key2가 있어서
(integer) 0

# 두번쨰 MSETNX가 실행이 안되었음을 확인할 수 있다.
redis:6379> MGET key1 key2 key3
1) "Hello"
2) "world"
3) (nil)
```


## PSETEX key ms value 

Redis의 PSETEX 명령어는 특정 키에 값을 저장할 때 쓰이는데, ms이후 값이 사라집니다.

### Return Value

간단한 문자열인 OK가 응답됩니다.

### Syntax

PSETEX 명령어는 다음 문법 구조를 가집니다.

```
redis 6379> PSETEX <KEY_NAME> <EXPIRE_TIME_MS> <VALUE>
```

### Example

터미널에 다음을 입력하세요.

```bash
# mykey1에 10000ms(10초)동안 "Hello" 저장
redis:6379> PSETEX mykey1 10000 "Hello"
OK

# 남은 시간 확인
redis:6379> PTTL mykey1
(integer) 4633

# 값 확인
redis:6379> GET mykey1
"Hello"

# 10초 후 값 확인
redis:6379> GET mykey1
(nil)
```


## INCR key 

Redis의 INCR 명령어는 키에 저장된 숫자를 하나 증가시킵니다. 키가 존재하지 않는다면, 연산 실행 이전에 0을 저장합니다. 
키에 잘못된 타입의 값이 있거나 정수로 표현할 수 없는 문자열이 포함 된 경우 오류가 리턴됩니다. 이 명령어는 오직 64 bit 부호가 있는 정수에만 연산을 가할 수 있습니다. 

### Return Value

키에 저장된 값에 하나 증가한 정수가 반환됩니다.

### Syntax

```
redis:6379> INCR <KEY_NAME> 
```

### Example

터미널에 다음을 입력해주세요.

```bash
# visitors에 1000 설정
redis:6379> SET visitors 1000
OK

# 값 증가
redis:6379> INCR visitors
(integer) 1001

# 확인
redis:6379> GET visitors
"1001"
```


## INCRBY key increment 

### Return Value

### Syntax

### Example

## INCRFLOAT key increment

### Return Value

### Syntax

### Example

## DECR key

### Return Value

### Syntax

### Example

## DECRBY key decrement 

### Return Value

### Syntax

### Example

## APPEND key value 

### Return Value

### Syntax

### Example
