Strings
============

Redis에서 문자열 명령어들은 Redis의 문자열 값들을 관리하는데 사용됩니다. "Syntax"절에 나와있는 Redis 문자열 명령어들을 따라해보세요. 

## Syntax

Redis에서 문자열 조작 명령어들은 다음 형태로 구성됩니다.

```bash
redis:6379> <명령어> <KEY 이름> (<값..>)
```

## Example

Redis에서 문자열을 저장하고 가져와보겠습니다. 터미널에 다음을 입력해주세요.

```bash
# "tutorial" 키에 "REDIS"라는 값을 저장
redis:6379> SET tutorial REDIS
OK

# "tutorial"키에 저장된 값 반환
redis:6379> GET tutorial
"REDIS"
```

위는 "string" 타입에 대한 GET, SET 명령어의 예를 보여줍니다. 여기서 키는 "tutorial"입니다.


## Redis String sCommands

다음 테이블은 Redis에서 string 타입을 조작하기 위한 기초 명령어들을 보여줍니다.

| Sr.No | Command | Description |
| ----- | ------- | ----------- |
| 01 | SET key value | 이 명령어는 특정 키에 값을 설정합니다. |
| 02 | GET key | 키의 값을 가져옵니다. |
| 03 | GETRANGE key start end | 키에 저장된 문자열의 일부분을 가져옵니다. |
| 04 | GETSET key value | 키에 해당 값을 저장하고, 이전에 저장한 값을 반환합니다. |
| 05 | GETBIT key offset | 키에 저장된 문자열의 오프셋의 비트 값을 반환합니다. |
| 06 | MGET key1 [key2 ..] | 여러 키에 저장된 각 문자열들을 가져옵니다. |
| 07 | SETBIT key offset value | 키에 저장된 문자열 값에서 오프셋의 비트를 설정하거나 지웁니다. |
| 08 | SETEX key seconds value | 해당 키에 값을 seconds만큼 저장합니다.  |
| 09 | SETNX key value | 키가 존재하지 않을 때만, 키의 값을 저장합니다. |
| 10 | SETRANGE key offset value | 키에 저장된 문자열에서, 지정된 오프셋부터 값을 덮어씁니다. |
| 11 | STRLEN key | 키의 저장된 문자열의 길이를 불러옵니다. |
| 12 | MSET key value [key2 value2..] | 여러 키에 각 값을 저장합니다. |
| 13 | MSETNX  key value [key2 value2..] | 여러 키에, 존재하지 않은 키라면 각 값을 저장합니다. |
| 14 | PSETEX key ms value | ms동안만 키에 값을 저장합니다. |
| 15 | INCR key | 키에 저장된 값을 1 올립니다. |
| 16 | INCRBY key increment | 키에 저장된 값을 주어진 정수만큼 올립니다. |
| 17 | INCRFLOAT key increment | 키의 저장된 값을 주어진 실수만큼 올립니다. |
| 18 | DECR key | 키에 저장된 값을 1 내립니다. |
| 19 | DECRBY key decrement | 키에 저장된 값을 주어진 정수만큼 줄입니다. |
| 20 | APPEND key value | 키에 저장된 값에 value를 추가합니다. |


## SET key value 

Redis SET 커맨드는 특정 키에 string 타입의 값을 설정할 때 쓰입니다.

### Return Value

요청이 성공하면 "OK"라는 간단한 문자열을 응답 받습니다. 설정되지 않다면 "Null"이 반환됩니다.

### Syntax

SET 커맨드의 기본 구조는 다음과 같습니다.

```
redis:6379> SET <KEY NAME> <VALUE>
```

### Example

터미널에 다음을 입력해주세요

```bash
redis:6379> SET mykey myvalue
OK
```

### Options

SET 커맨드는 사용할 수 있는 다양한 옵션들이 있습니다. 다음 문법은 SET 커맨드의 다양한 옵션으 쓰는 것을 보여줍니다.

```
redis:6379> SET <KEY NAME> <VALUE> [EX seconds] [PX ms] [NX|XX]
```

* EX seconds - 저장 후 소멸 시간을 설정합니다. 단위는 초입니다.
* PX ms - 저장 후 소멸 시간을 설정합니다. 단위는 ms입니다.
* NX - 존재하지 않는 키에만 값을 설정합니다.
* XX - 존재하는 키에만 값을 설정합니다.

### Example

다음을 터미널에 입력해주세요.

```bash
redis:6379> SET mykey myvalue EX 60 NX
OK
```

이 예의 경우 mykey 라는 키의, myvalue 값을 저장합니다. 그러나 60초 후에 사라지며, mykey이라는 키가 저장되어 있지 않을 때만 동작합니다.


## GET key 

Redis의 GET 커맨드는 특정 키에 저장된 값을 가져올 때 사용합니다. 만약, 키가 존재하지 않는다면, "nil"을 반환하게 됩니다. string 타입의 값이 아닐 경우, 에러를 반환합니다.

### Return Value

간단한 문자열이 응답됩니다. 키에 저장된 값이나 "nil"이 반환됩니다.

### Syntax

다음 문법으로 GET 명령어를 사용할 수 있습니다.

```
redis:6379> GET <KEY NAME> 
```

### Example

먼저 키를 설정한 후, 값을 가져와보도록 하겠습니다. 터미널에 다음을 입력하세요.

```bash
# 문자열 저장
redis:6379> SET mykey myvalue
OK
# 문자열 가져오기
redis:6379> GET mykey
"myvalue"
```


## GETRANGE key start end 

Redis의 GETRANGE 명령어는 키에 저장된 문자열의 부분 문자열을 가져오기 위해서 사용합니다. 키와 함께 부분 문자열의 start, end 오프셋을 입력해야 합니다. Redis는 음수 offset을 제공하는데, 덕분에 우리는 저장된 문자열 끝에서부터 시작하여, 오프셋을 조작할 수 있습니다. (마치 파이썬처럼..)

### Return Value

간단한 문자열이 반환됩니다.

### Syntax

GETRANGE 커맨드는 다음 구조를 가집니다.

```
redis:6379> GETRANGE <KEY_NAME> <start> <end>
```

### Example

한 번 문자열을 저장한 후, 부분 문자열을 가져와보도록 하겠습니다. 터미널에 다음을 입력하세요,

```bash
# 문자열 저장
redis:6379> SET mykey "This is my test key"
OK
# 0~3까지 부분 문자열 가져오기 
redis:6379> GETRANGE mykey 0 3 
"This"
# 0~-1(끝)까지 부분 문자열 가져오기 
redis:6379> GETRANGE mykey 0 -1
"This is my test key"
```


## GETSET key value 

Redis의 GETSET 커맨드는 특정 키의 지정한 값을 저장하고, 그것의 옛 값을 반환합니다.

### Return Value

해당 키가 이전에 저장했던 값을 반환합니다. 만약, 키가 존재하지 않다면, "nil"이 반환됩니다.

### Syntax

GETSET 커맨드는 다음의 문법 구조를 지닙니다.

```
redis:6379> GETSET <KEY_NAME> <VALUE>
```

### Example

한 번 "mykey"라는 키에 GETSET을 2번 실행해보겠습니다. 터미널에 다음을 입력해주세요.

```bash
# GETSET 실행
redis:6379> GETSET mykey "This is my test key"
# 이전에 키가 없기 떄문에 nil
(nil)

# GETSET 실행
redis:6379> GETSET mykey "This is my new value to test getset"
# 이전 값 출력
"This is my test key"
```


## GETBIT key offset 

Redis GETBIT 커맨드는 키에 저장된 문자열의 오프셋에서 비트 값을 가져 오는데 사용됩니다.

### Return Value

정수가 반환되며, 이 정수는 offset에 저장된 비트 값입니다.

### Syntax

GETBIT 명령어는 다음과 같은 문법 구조를 가지고 있습니다.

```
radis:6379> GETBIT <KEY_NAME> <OFFSET>
```

### Example

```bash 
# mykey의 offset 7에 1bit 설정
redis:6379> SETBIT mykey 7 1 
(integer) 0 

# mykey의 offset 0을 가져옴. 기본 0
redis:6379> GETBIT mykey 0 
(integer) 0 

# mykey의 offset 7을 가져옴. 
redis:6379> GETBIT mykey 7 
(integer) 1 
redis:6379> GETBIT mykey 100
(integer) 0 
```


## MGET key1 [key2 ..] 

Redis의 MGET 명령어는 한번에 여러키의 값들을 가져올 때 사용됩니다. 문자열이 저장되어 있지 않거나, 존재하지 않은 키라면, "nil"이라는 특별한 값을 반환합니다.

### Return Value

특정 키들의 리스트를 반환합니다.

### Syntax

MGET 커맨드는 다음과 같은 문법 구조를 가지고 있습니다.

```
redis:6379> MGET <KEY1> <KEY2> ..
```

### Example

여러 키를 저장하고 한 번에 불러와보겠습니다. 터미널에 다음을 입력하세요.

```bash
redis:6379> SET key1 "hello"
OK
redis:6379> SET key2 "world"
OK
redis:6379> MGET key1 key2 key3
1) "hello"
2) "world"
3) (nil)
```

key1, key2를 저장하고 MGET으로 한 번에 불러옵니다. 그러나, key3는 저장되어 있지 않기 때문에, nil 이라는 값이 반환되게 됩니다.


## SETBIT key offset value 

## SETEX key seconds value 

## SETNX key value 

## SETRANGE key offset value 

## STRLEN key

## MSET key value [key2 value2..]

## MSETNX  key value [key2 value2..]

## PSETEX key ms value 

## INCR key 

## INCRBY key increment 

## INCRFLOAT key increment

## DECR key

## DECRBY key decrement 

## APPEND key value 
