Lists
============

Redis의 "List"타입은 간단한 문자열 리스트이며, 삽입된 순으로 정렬되어 있습니다. 당신은 리스트의 머리/꼬리 삽입 연산을 할 수 있습니다. 리스트 타입은 2^31-1개 만큼 원소를 저장할 수 있습니다.

## Example

터미널에 다음을 입력해주세요.

```bash
# mylist에 "redis" 저장
redis:6379> LPUSH mylist redis
# 리스트 길이 반환
(integer) 1

# mylist에 "mongo" 저장
redis:6379> LPUSH mylist mongo
(integer) 2

# mylist에 "mysql" 저장
redis:6379> LPUSH mylist mysql
(integer) 3

# "mylist" 0부터 9까지 원소를 가져옴.
redis:6379> LRANGE mylist 0 10
1) "mysql"
2) "mongo"
3) "redis"
```

위 예제는 Redis에 "mylist"라는 리스트를 만들고 3개의 값을 LPUSH 명령어를 통해서 저장하는 내용입니다.


## Redis Lists Commands

List 타입의 기초 명령어들은 다음과 같습니다.

| Sr.No | Command | Description |
| ----- | ------- | ----------- |
| 01 | BLPOP key1 [key2 ] timeout | 리스트에서 첫 원소를 삭제하고 가져옵니다. 또한 주어진 타임아웃까지 모든 연산을 차단합니다. |
| 02 | BRPOP key1 [key2 ] timeout | 리스트에서 마지막 원소를 삭제하고 가져옵니다. 또한 주어진 타임아웃까지 모든 연산을 차단합니다. |
| 03 | BRPOPLPUSH source destination timeout | 리스트의 값들을 빼내어 다른 리스트에 저장한 후 그것을 반환합니다. 혹은 하나를 사용할 수 있을 때까지 차단합니다. |
| 04 | LINDEX key index | 리스트의 인덱스에 위치한 원소를 가져옵니다.  |
| 05 | LINSERT key BEFORE|AFTER pivot value | 리스트에서 특정 위치 앞/뒤로 값을 넣습니다.  |
| 06 | LLEN key | 리스트의 길이를 반환합니다. |
| 07 | LPOP key | 첫번째 원소를 삭제한 후 반환합니다. |
| 08 | LPUSH key value1 [value2..] | 리스트의 원소를 추가합니다. 이 때 여러 값을 동시에 추가할 수 있습니다.|
| 09 | LPUSHX key value | 리스트가 존재할 때만 값을 넣습니다. |
| 10 | LRANGE key start stop | 리스트의 start부터 stop까지의 원소들을 반환합니다. |
| 11 | LREM key count value | 리스트에서 원소들을 삭제합니다. |
| 12 | LSET key index value | 특정 인덱스의 값을 입력값으로 저장합니다. |
| 13 | LTRIM key start stop | 리스트의 특정 범위까지 Trim합니다. |
| 14 | RPOP key | 가장 마지막 원소를 삭제한 후 가져옵니다. |
| 15 | RPOPPUSH source destination | 가장 마지막 원소를 삭제한 후, 그 값을 다른 리스트에 추가한 다음 반환합니다. |
| 16 | RPUSH key value1 [value2..] |리스트의 여러 값을 추가합니다. |
| 17 | RPUSHX key value | 리스트가 존재할 때 값을 추가합니다. |


## BLPOP key1 [key2 ] timeout

Redis BLPOP 명령어는, 리스트에서 첫 원소를 가져오는데 사용되며, 원소가 없다면, 주어진 timeout까지 요청을 막습니다. BLPOP 명령어는 리스트를 이용 가능할 때 단순히 첫 원소를 반환하는데, 만약 리스트의 원소가 없다면, 유저가 어떤 명령어를 실행하더라도 특정 시간동안 그것을 막습니다.

### Return Value

문자열을 반환합니다. 이는 키에 저장된 원소 혹은 "nil"입니다.

### Syntax

BLPOP 명령어는 다음의 문법 구조를 가집니다.

```
redis:6379> BLPOP <LIST1> [<LIST2> ...] <TIMEOUT> 
```

### Example

터미널에 다음을 입력해주세요.

```bash
# list1 에 10, 20, 30 넣음 [30, 20, 10]
redis:6379> LPUSH list1 10 20 30
(integer) 3

# list2 에 10, 20 넣음 [20, 10]
redis:6379> LPUSH list2 20 30
(integer) 2

# BLPOP 첫 인수부터 1개씩 빠짐
redis:6379> BLPOP list1 list2 10
1) "list1"
2) "30"
redis:6379> BLPOP list1 list2 10
1) "list1"
2) "20"
redis:6379> BLPOP list1 list2 10
1) "list1"
2) "10"

# BLPOP list1에 원소가 다빠지면 list2가 빠짐
redis:6379> BLPOP list1 list2 10
1) "list2"
2) "30"
redis:6379> BLPOP list1 list2 10
1) "list2"
2) "20"

# BLPOP list1, list2, 원소가 없을때, 주어진 timeout 10초간 입력을 막음
redis:6379> BLPOP list1 list2 10
# 10초후...s
(nil)
(10.04s)
```

위의 예제에서 가장 마지막 BLPOP 명령어 실행 시, 인수로 전달된 list1, list2의 원소가 없을므로 10초간, Redis는 클라이언트의 요청을 블락킹합니다.


## BRPOP key1 [key2 ] timeout

Redis BRPOP 명령어는, 리스트에서 마지막 원소를 가져오는데 사용되며, 원소가 없다면, 주어진 timeout까지 요청을 막습니다. BRPOP 명령어는 리스트를 이용 가능할 때 단순히 마지막 원소를 반환하는데, 만약 리스트의 원소가 없다면, 유저가 어떤 명령어를 실행하더라도 특정 시간동안 그것을 막습니다.

### Return Value

문자열을 반환합니다. 이는 키에 저장된 원소 혹은 "nil"입니다.

### Syntax

BRPOP 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> BRPOP <LIST1> [<LIST2> ..] <TIMEOUT>
```

### Example

터미널에 다음을 입력해주세요.

```bash
# list1 에 10, 20, 30 넣음 [30, 20, 10]
redis:6379> LPUSH list1 10 20 30
(integer) 3

# list2 에 10, 20 넣음 [20, 10]
redis:6379> LPUSH list2 20 30
(integer) 2

# BRPOP list1부터 마지막 원소를 뺌
redis:6379> BRPOP list1 list2 10
1) "list1"
2) "10"
redis:6379> BRPOP list1 list2 10
1) "list1"
2) "20"
redis:6379> BRPOP list1 list2 10
1) "list1"
2) "30"

# BRPOP list1이 비었으니 list2에서 마지막 원소를 뺌
redis:6379> BRPOP list1 list2 10
1) "list2"
2) "20"
redis:6379> BRPOP list1 list2 10
1) "list2"
2) "30"

# list1, list2 아무 원소가 없으니 10초간 블라킹됨
redis:6379> BRPOP list1 list2 10
(nil)
(10.06s)
```

위의 예제에서 가장 마지막 BRPOP 명령어 실행 시, 인수로 전달된 list1, list2의 원소가 없을므로 10초간, Redis는 클라이언트의 요청을 블락킹합니다.


## BRPOPLPUSH source destination timeout

Redis의 BRPOPLPUSH 명령어는 한 리스트로부터, 값을 POP해서 다른 리스트의 PUSH하고 그 값을 반환합니다. 역시, 리스트에 원소가 없다면 블락킹이 일어납니다. BRPOPLPUSH 명령어는 단지, 리스트에 원소가 있다면 마지막 원소를 반환해서, 다른 리스트에 삽입합니다. 그렇지 않다면, 사용자의 요청을 주어진 timeout만큼 막습니다.

### Return Value

그 키에 저장된 원소 혹은 nil을 반환합니다.

### Syntax

BRPOPLPUSH 명령어는 다음의 문법 구조를 가집니다.

```
redis:6379> BRPOPLPUSH <SOURCE LIST> <DESTINATION LIST> <TIMEOUT>
```

### Example

터미널에 다음을 입력하세요.

```bash
# list1 1, 2, 3 저장 [3, 2, 1]
redis:6379> LPUSH list1 1 2 3
(integer) 3

# list2 2, 3 저장 [3, 2]
redis:6379> LPUSH list2 2 3
(integer) 2

# list1에 가장 마지막 원소 1이 list2 첫 원소로 들어옴. [1, 3, 2]
redis:6379> BRPOPLPUSH list1 list2 10
"1"

# list1에 가장 마지막 원소 2이 list2 첫 원소로 들어옴. [2, 1, 3, 2]
redis:6379> BRPOPLPUSH list1 list2 10
"2"

# list1에 가장 마지막 원소 3이 list2 첫 원소로 들어옴. [3, 2, 1, 3, 2]
redis:6379> BRPOPLPUSH list1 list2 10
"3"

# list1이 비었기 때문에, 10초간 블락당함.
redis:6379> BRPOPLPUSH list1 list2 10
(nil)
(10.01s)
```

가장 마지막 BRPOPLPUSH 명령어에서 list1은 비었기 떄문에, Redis는 주어진 timeout 10초간, 사용자의 요청을 블라킹하게 됩니다.


## LINDEX key index 

Redis의 LINDEX 명령어는 키에 저장된 리스트가 저장하는 원소들 중 해당 인덱스에 해당하는 원소를 반환합니다. 인덱스는 0부터 시작하며, 0이 첫 원소, 1이 두 번째 원소 이런 식입니다. Redis는 또한, 음수 인덱스도 지원합니다. 예를 들어, -1은 리스트의 가장 마지막 원소, -2는 마지막에서 2번째 원소입니다.

### Return Value

리스트의 해당 인덱스에 저장된 원소가 반환됩니다. 범위를 벗어났다면, nil을 반환합니다.

### Syntax

LINDEX 명령어의 문법 구조는 다음과 같습니다.

```
redis:6379> LINDEX <KEY_NAME> <INDEX>
```

### Example

터미널에 다음을 입력하세요.

```bash
# list1에 1, 2, 3 저장 [3, 2, 1]
redis:6379> LPUSH list1 1 2 3
(integer) 3

# 0번째 원소 반환
redis:6379> LINDEX list1 0
"3"

# 마지막 원소 반환
redis:6379> LINDEX list1 -1
"1"

# 없는 인덱스의 경우, nil 반환
redis:6379> LINDEX list1 4
(nil)
```


## LINSERT key BEFORE|AFTER pivot value

Redis의 LINSERT 명령어는 해당 키에 저장된 리스트에서 피벗을 참조하여 그 기준 앞 혹은 뒤에 값을 저장합니다. 키가 존재하지 않을 경우, 빈 리스트라고 생각하여, 연산을 수행하지 않습니다. 만약 리스트는 존재하나, 리스트 안에 피벗 값이 없다면, 에러를 반환합니다.

### Return Value

삽입 연산 이후 리스트의 길이를 반환합니다. 찾지 못할 경우 -1을 반환합니다.

### Syntax

LINSERT는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> LINSERT <KEY_NAME> [BEFORE|AFTER] <EXISTING_VALUE> <NEW_VALUE>
```

### Example

터미널에 다음을 입력하세요.

```bash
# list1에 1, 2, 3 저장 [3, 2, 1]
redis:6379> LPUSH list1 1 2 3
(integer) 3

# 저장되있지 않은 list 원소 삽입(실패 0 반환)
redis:6379> LINSERT list AFTER 4 2
(integer) 0

redis:6379> LRANGE list 0 5
(empty list or set)

# 저장된 list1에 저장되있지 않은 pivot 선택 후 삽입 (실패 -1 반환)
redis:6379> LINSERT list1 AFTER 4 3
(integer) -1

# 3 뒤에 4 삽입 [3, 4, 2, 1]
redis:6379> LINSERT list1 AFTER 3 4
(integer) 4

# 3 앞에 2 삽입 [2, 3, 4, 2, 1]
redis:6379> LINSERT list1 BEFORE 3 2
(integer) 5
redis:6379> LRANGE list1 0 5
1) "2"
2) "3"
3) "4"
4) "2"
5) "1"
```


## LLEN key 

### Return Value
### Syntax
### Example


## LPOP key 

### Return Value
### Syntax
### Example


## LPUSH key value1 [value2..]

### Return Value
### Syntax
### Example


## LPUSHX key value

### Return Value
### Syntax
### Example


## LRANGE key start stop 

### Return Value
### Syntax
### Example


## LREM key count value

### Return Value
### Syntax
### Example


## LSET key index value

### Return Value
### Syntax
### Example


## LTRIM key start stop 

### Return Value
### Syntax
### Example


## RPOP key

### Return Value
### Syntax
### Example


## RPOPPUSH source destination

### Return Value
### Syntax
### Example


## RPUSH key value1 [value2..] 

### Return Value
### Syntax
### Example


## RPUSHX key value

### Return Value
### Syntax
### Example


