Sorted Sets
==========

Redis의 Sorted Set은 값을 저장하는데 있어서, Redis Set과 유사합니다. 차이점은 모든 멤버가, Score와 연관이 되어 있어서, 가장 작은 점수를 가진 멤버에서 큰 점수를 가진 멤버로 정렬하여 저장한다는 것입니다.

Sorted Set은 O(1)의 멤버를 추가, 제거 존재 유무를 확인할 수 있으며, 최대 2^32-1개만큼 요소를 저장할 수 있습니다.


## Example

```bash
redis 127.0.0.1:6379> ZADD tutorials 1 redis 
(integer) 1 
redis 127.0.0.1:6379> ZADD tutorials 2 mongodb 
(integer) 1 
redis 127.0.0.1:6379> ZADD tutorials 3 mysql 
(integer) 1 

redis 127.0.0.1:6379> ZRANGE tutorials 0 10 WITHSCORES  
1) "redis" 
2) "1" 
3) "mongodb" 
4) "2" 
5) "mysql" 
6) "3" 

redis 127.0.0.1:6379> ZADD tutorials 4 mysql 
(integer) 0 

redis 127.0.0.1:6379> ZRANGE tutorials 0 10 WITHSCORES  
1) "redis" 
2) "1" 
3) "mongodb" 
4) "2" 
5) "mysql" 
6) "4" 
```

위의 예제에서는 Redis의 ZADD 명령어를 이용해 "tutorials" 라는 Sorted Set을 만들고, 스코어와 함께 3개의 값들을 저장하였습니다.


## Redis Sorted Sets Commands

| Sr.No | Command | Description |
| ----- | ------- | ----------- |
| 01 | ZADD key score1 member1 [score2 member2] | 하나 이상의 멤버를 Sorted Set에 추가합니다. 이미 존재한다면, 스코어만 갱신됩니다. |
| 02 | ZCARD key | Sorted Set의 개수를 반환합니다. |
| 03 | ZCOUNT key min max | min~max 사이의 스코어를 가진 멤버들의 개수를 반환합니다. |
| 04 | ZINCRBY key increment member | 멤버의 스코어를 증가시킵니다. |
| 05 | ZINTERSTORE destination numkeys key [key ...] | 여러 셋의 교집합을 하나의 키에 저장합니다. |
| 06 | ZLEXCOUNT key min max | 사전 식 범위 사이에 있는 멤버들의 개수를 셉니다. |
| 07 | ZRANGE key start stop [WITHSCORES] | 해당 범위에 존재하는 Sorted Set의 멤버들을 인덱스별로 반환합니다 |
| 08 | ZRANGEBYLEX key min max [LIMIT offset count] | 사전식 범위의 존재하는 Sorted Set의 멤버들을 반환합니다. |
| 09 | ZRANGEBYSCORE key min max [WITHSCORES] [LIMIT] | 스코어 범위에 있는 Sorted Set의 멤버들을 반환합니다. |
| 10 | ZRANK key member | Sorted Set의 멤버의 인덱스를 결정합니다. |
| 11 | ZREM key member [member ...] | Sorted Set에서 하나 이상의 멤버를 삭제합니다. |
| 12 | ZREMRANGEBYLEX key min max | 사전식 범위에 있는 Sorted Set의 모든 멤버를 삭제합니다. |
| 13 | ZREMRANGEBYRANK key start stop | 주어진 인덱스 안에 있는 Sorted Set의 모든 멤버를 삭제합니다. |
| 14 | ZREMRANGEBYSCORE key min max | 주어진 스코어 안에 있는 Sorted Set의 모든 멤버들을 삭제합니다. |
| 15 | ZREVRANGE key start stop [WITHSCORES] | Sorted Set의 멤버들을 반환하며, 인덱스와 함께 스코어 기준 내림차순으로 정렬합니다.  |
| 16 | ZREVRANGEBYSCORE key max min [WITHSCORES] | Sorted Set의 멤버들을 반환하며, 스코어에 의해 내림차순으로 정렬합니다. |
| 17 | ZREVRANK key member | Sorted Set의 멤버들의 인덱스를 결정하며, 스코어 기준 내림차순으로 정렬합니다. |
| 18 | ZSCORE key member | Sorted Set에서 주어진 멤버와 관련된 스코어를 가져옵니다. |
| 19 | ZUNIONSTORE destination numkeys key [key ...] | 여러 Sorted Set의 합집합 결과를 새 키에 저장합니다. |
| 20 | ZSCAN key cursor [MATCH pattern] [COUNT count] | Sorted Set의 스코어와 연관된 요소들을 점진적으로 순회합니다.  |


## 01. ZADD key score1 member1 [score2 member2]

Redis의 ZADD 명령어는 키에 저장된 sorted set에 특정 점수와 함께 멤버들을 추가할 때 사용됩니다. 특정 다수의 스코어/멤버 쌍으로 저장하는 것이 가능합니다. 만약 sorted set에 멤버가 존재한다면, 스코어만 업데이트하여, 정렬 순서에 맞게 재삽입합니다. 키가 존재하지 않을 경우, sorted set이 새로 만들어지며 그 빈 셋에 멤버를 삽입합니다. 키가 존재하나, sorted set이 아닐 경우 에러를 반환합니다.

### Return Value

정수가 반환됩니다. 이 정수는, sorted set의 추가된 원소들의 개수이며, score가 업데이트 된 경우, 개수에 포함되지 않습니다.

### Syntax

ZADD 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZADD <KEY> <SCORE 1> <VALUE 1> [ <SCORE 2> <VALUE2> ...]
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 1-"hello" 추가
redis:6379> ZADD myset 1 "hello"
(integer) 1

# myset 3-"hello" 추가 "hello"는 있으므로 스코어만 업데이트
redis:6379> ZADD myset 3 "hello"
# 그래서 추가 개수로 치지 않아 0
(integer) 0

# 2-"Redis" 3-"Tutorial" 추가
redis:6379> ZADD myset 2 "Redis" 3 "Tutorial"
(integer) 2

# myset 처음부터 끝까지 스코어와 함께 출력
redis:6379> ZRANGE myset 0 -1 WITHSCORES
1) "Redis"
2) "2"
3) "Tutorial"
4) "3"
5) "hello"
6) "3"
```


## 02. ZCARD key

Redis의 ZCARD 명령어는 키에 저장된 sorted set의 개수를 반환합니다.

### Return Value

sorted set이 가지고 있는 원소의 개수가 반환됩니다. 키가 존재하지 않다면, 0을 반환합니다.

### Syntax

ZCARD 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZCARD <KEY>
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 원소 3개 추가
redis:6379> ZADD myset 1 "hello" 2 "Redis" 3 "Tutorial"
(integer) 3

# myset 개수 반환
redis:6379> ZCARD myset
(integer) 3
```


## 03. ZCOUNT key min max

Redis의 ZCOUNT 명령어는 키에 저장된 sorted set의 원소들 중 min과 max 사이의 스코어를 가진 원소들의 개수를 반환합니다.

### Return Value

스코어 범위 안에 있는 원소들의 개수를 반환합니다.

### Syntax

ZCOUNT 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZCOUNT <KEY> <MIN> <MAX>
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 생성
redis:6379> ZADD myset 1 "Hello" 2 "Redis" 3 "Tutorial"
(integer) 3

# 스코어 2 ~ 3 인 원소들의 개수 반환
redis:6379> ZCOUNT myset 2 3
(integer) 2
```

## 04. ZINCRBY key increment member

### Return Value

Redis의 ZINCRBY 명령어는 키에 저장된 sorted set의 멤버의 스코어를 증가시킵니다. 만약 셋에 멤버가 없다면, 스코어 0에 멤버를 저장한 후, 스코어를 증가시킵니다. 키가 존재하지 않는다면, 빈 셋의 멤버를 만들고, 멤버를 만듭니다. 키에 저장된 것이 sorted set이 아니라면, 에러를 반환합니다.

### Syntax

ZINCRBY 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> ZINCRBY <KEY> <INCREMENT> <MEMBER>
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 생성
redis:6379> ZADD myset 1 Hello 2 Redis 3 Tutorial
(integer) 3

# myset 확인
redis:6379> ZRANGE myset 0 -1 WITHSCORES
1) "Hello"
2) "1"
3) "Redis"
4) "2"
5) "Tutorial"
6) "3"

# myset tutorial 스코어 2 증가
redis:6379> ZINCRBY myset 2 Tutorial
"5"

# 연산 결과 확인
redis:6379> ZRANGE myset 0 -1 WITHSCORES
1) "Hello"
2) "1"
3) "Redis"
4) "2"
5) "Tutorial"
6) "5"
```

## 05. ZINTERSTORE destination numkeys key [key ...]

Redis의 ZINTERSTORE 명령어는 주어진 sorted set의 교집합을 destination에 저장할 때 사용됩니다. 이때, 입력 키들을 전달하기 전에 키들의 개수 numkeys를 전달해야 합니다.

### Return Value

sorted set들의 교집합인 destination의 원소들의 개수를 반환합니다.

### Syntax

ZINTESTORE 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> ZINTERSTORE <DESTINATION KEY> <NUMKEY> <KEY 1> .. <KEY N> [WEIGHT ..]
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 생성
redis:6379> ZADD myset 1 Hello 2 Redis 3 Tutorial
(integer) 3

# myset2 생성
redis:6379> ZADD myset2 1 Hell 2 Redis 3 Fuck
(integer) 3

# 교집합 myset n myset2 = myset3
redis:6379> ZINTERSTORE myset3 2 myset myset2
(integer) 1

# myset3 확인
redis:6379> ZRANGE myset3 0 -1 WITHSCORES
1) "Redis"
2) "4"
```


## 06. ZLEXCOUNT key min max

### Return Value
### Syntax
### Example

## 07. ZRANGE key start stop [WITHSCORES]

### Return Value
### Syntax
### Example

## 08. ZRANGEBYLEX key min max [LIMIT offset count]

### Return Value
### Syntax
### Example

## 09. ZRANGEBYSCORE key min max [WITHSCORES] [LIMIT]

### Return Value
### Syntax
### Example

## 10. ZRANK key member
## 11. ZREM key member [member ...]

### Return Value
### Syntax
### Example

## 12. ZREMRANGEBYLEX key min max

### Return Value
### Syntax
### Example

## 13. ZREMRANGEBYRANK key start stop

### Return Value
### Syntax
### Example

## 14. ZREMRANGEBYSCORE key min max

### Return Value
### Syntax
### Example

## 15. ZREVRANGE key start stop [WITHSCORES]

### Return Value
### Syntax
### Example

## 16. ZREVRANGEBYSCORE key max min [WITHSCORES]

### Return Value
### Syntax
### Example

## 17. ZREVRANK key member
## 18. ZSCORE key member
## 19. ZUNIONSTORE destination numkeys key [key ...]

### Return Value
### Syntax
### Example

## 20. ZSCAN key cursor [MATCH pattern] [COUNT count]     

### Return Value
### Syntax
### Example
