Sets
==========

Redis의 Set 타입은, 유니크한 문자열의 집합입니다. 여기서 "유니크 하다"란 같은 키의 중복을 허용하지 않는다라는 뜻입니다. Redis의 Set은 add, remove, 존재 유무 확인을 O(1) 즉 상수 시간에 처리할 수 있습니다. Set이 저장할 수 있는 최대 원소의 개수는 2^32-1개입니다.

## Example

터미널에 다음을 입력하세요.

```bash
# set1 키에 Set을 만들고 redis 저장
redis:6379> SADD set1 redis
(integer) 1

# set1에 mongo 저장
redis:6379> SADD set1 mongo
(integer) 1

# set1에 mysql 저장
redis:6379> SADD set1 mysql
(integer) 1

# set1에 mysql 저장
redis:6379> SADD set1 mysql
# 실패 이미 저장하고 있기 때문에.
(integer) 0

# 값 확인
redis:6379> SMEMBERS set1
1) "mysql"
2) "redis"
3) "mongo"
```

위 예제는 Redis Set의 SADD 해서 원소를 추가하고, SMEMBERS를 통해 원소들을 확인하는 내용입니다.


## Redis Sets Commands

| Sr.No | Command | Description |
| ----- | ------- | ----------- |
| 01 | SADD key member1 [member2 ..] | 셋의 하나 이상의 멤버를 추가합니다. |
| 02 | SCARD key | 셋의 멤버의 개수를 반환합니다. |
| 03 | SDIFF key1 [key2 ..] | 여러 셋의 차집합을 구합니다. |
| 04 | SDIFFSTORE destination key1 [key2 ..] | 여러 셋의 차집합을 구한 뒤 한 키에 저장합니다. |
| 05 | SINTER key1 [key2 ..] | 여러 셋의 교집합을 구합니다. |
| 06 | SINTERSTORE destination key1 [key2 ..] | 여러 셋의 교집합을 구한 뒤 한 키에 저장합니다. |
| 07 | SISMEMBER key member | 셋의 멤버인지 확인합니다. |
| 08 | SMEMBERS key | 셋의 멤버들을 가져옵니다. |
| 09 | SMOVE source dstination member | 하나의 셋에서 다른 셋으로 멤버를 이동합니다. |
| 10 | SPOP key | 셋에서 무작위로 멤버 하나를 삭제합니다. |
| 11 | SRANDMEMBER key [count] | 셋에서 무작위로 여러 멤버를 가져옵니다. |
| 12 | SREM key member1 [member2 ..] | 셋에서 하나 이상의 멤버를 삭제합니다. |
| 13 | SUNION key1 [key2 ..] | 여러 셋의 합집합을 구합니다. |
| 14 | SUNIONSTORE destination key1 [key2 ..] | 여러 셋의 합집합을 구한 뒤 한 키에 저장합니다. |
| 15 | SSCAN key cursor [MATCH pattern] [COUNT count] | 세트의 요소들을 점진적으로 반복합니다. |


## 01. SADD key member1 [member2 ..] 

Redis에서 SADD 명령어는 키에 저장된 셋에서 멤버를 추가할 때 사용됩니다. 만약 멤버가 존재한다면, 이것은 무시됩니다. 키가 존재하지 않는다면, 새로운 셋이 만들어지고, 멤버를 추가합니다. 셋이 아닌 값을 저장하는 키라면, 에러를 반환합니다.

### Return Value

정수가 반환됩니다. 셋에 추가되면 1, 아니라면 0을 반환합니다.

### Syntax

SADD 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> SADD <KEY_NAME> <VALUE1> [<VALUE2> ..]
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 셋 생성 후 redis 추가
redis:6379> SADD myset redis
(integer) 1

# myset에 mongo 추가
redis:6379> SADD myset mongo
(integer) 1

# myset에 mongo 추가 (실패)
redis:6379> SADD myset mongo
# 0 - 이미 있는 멤버라 추가되지 않음을 나타냄
(integer) 0

# myset에 저장되어 있는 모든 멤버 확인
redis:6379> SMEMBERS myset
1) "redis"
2) "mongo"
```


## 02. SCARD key

Redis의 SCARD 명령어는 Set에 저장되어 있는 원소들의 개수를 반환하는데 사용됩니다.

### Return Value

Set의 개수가 반환됩니다. 만약 존재하지 않은 키라면 0이 반환됩니다.

### Syntax

SCARD 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SCARD <KEY_NAME>
```

### Example

```bash
# 셋에 멤버 2개 추가
redis:6379> SADD myset hello
(integer) 1
redis:6379> SADD myset foo
(integer) 1

# 셋 개수 확인
redis:6379> SCARD myset
(integer) 2
```


## 03. SDIFF key1 [key2 ..]

Redis의 SDIFF 명령어는 첫 번째 셋과 그 이후의 모든 셋들 사이의 차집합을 반환합니다. Redis에 키가 존재하지 않을 때, 빈 셋으로 간주합니다.

### Return Value

차집합의 멤버들을 원소로 하는 배열이 반환됩니다.

### Syntax

SDIFF 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SDIFF <FIRST_KEY> [<OTHER_KEY> ...]
```

### Example

터미널에 다음을 입력하세요.

```bash
# set1 {1, 2, 3, 4, 5} 생성
redis:6379> SADD set1 1 2 3 4 5
(integer) 5

# set2 {2, 3} 생성
redis:6379> SADD set2 2 3
(integer) 2

# set1 기준, set1-set2인 집합 반환 {1, 4, 5}
redis:6379> SDIFF set1 set2
1) "1"
2) "4"
3) "5"
```


## 04. SDIFFSTORE destination key1 [key2 ..]

Redis의 SDIFFSTORE 명령어는 첫 번째 셋과 그 이후에 나오는 셋들의 차집합을 멤버로 하는 셋을 저장할 때 사용합니다. 만약, 이미 존재하는 키에 이 연산을 수행한다면, 덮어 씁니다.

### Return Value

결과인 셋의 원소의 개수가 반환됩니다.

### Syntax

SDIFFSTORE 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SDIFFSTORE <DESTINATION_SET> <KEY1> <KEY2> [...]
```

### Example

터미널에 다음을 입력하세요.

```bash
# set1 {1, 2, 3, 4, 5} 생성
redis:6379> SADD set1 1 2 3 4 5
(integer) 5

# set2 {2, 3} 생성
redis:6379> SADD set2 2 3
(integer) 2

# set3에 set1 - set2 저장
redis:6379> SDIFFSTORE set3 set1 set2
(integer) 3

# set3 확인
redis:6379> SMEMBERS set3
1) "1"
2) "4"
3) "5"
```


## 05. SINTER key1 [key2 ..]

Redis의 SINTER 명령어는, 셋들의 교집합을 얻고 싶을 때 쓰입니다. 키가 없다면, 빈 셋으로 간주합니다. 하나라도 빈 셋이 있다면 결과는 빈 셋이 나옵니다. (교집합이니까;;)

### Return Value

주어진 셋들의 교집합의 멤버들의 배열이 결과로 반환됩니다.

### Syntax

SINTER 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SINTER <KEY1> [<KEY2> ...]
```

### Example

터미널에 다음을 입력하세요.

```bash
# set1 {1, 2, 3, 4, 5} 생성
redis:6379> SADD set1 1 2 3 4 5
(integer) 5

# set2 {2, 3} 생성
redis:6379> SADD set2 2 3
(integer) 2

# SINTER 실행, A n B = B {2, 3}
redis:6379> SINTER set1 set2
1) "2"
2) "3"
```


## 06. SINTERSTORE destination key1 [key2 ..]

Redis의 SINTERSTORE 명령어는, 셋들의 교집합을 특정 키의 저장할 때 쓰입니다. 키가 없다면, 빈 셋으로 간주합니다. 하나라도 빈 셋이 있다면 결과는 빈 셋이 저장됩니다. (교집합이니까;;)

### Return Value

주어진 셋들의 교집합인 셋의 원소의 개수가 반환됩니다.

### Syntax

SINTERSTORE 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SINTERSTORE <DESTINATION_KEY> <KEY1> [<KEY2> ...]
```

### Example

터미널에 다음을 입력하세요.

```bash
# set1 {1, 2, 3, 4, 5} 생성
redis:6379> SADD set1 1 2 3 4 5
(integer) 5

# set2 {2, 3} 생성
redis:6379> SADD set2 2 3
(integer) 2

# SINTERSTORE 실행 set3 {2, 3} // set1 n set2 = set2
redis:6379> SINTERSTORE set3 set1 set2
(integer) 2

# set3 확인
redis:6379> SMEMBERS set3
1) "2"
2) "3"
```


## 07. SISMEMBER key member

Redis의 SISMEMBER는 키에 저장된 셋에 원소가 있는지 없는지 알아볼 때 씁니다.

### Return Value

정수형이 반환됩니다.

* 셋에 멤버가 있다면 1을 반환합니다.
* 셋에 멤버가 없다면 0을 반환합니다.

### Syntax

SISMEMBER 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SISMEMBER <KEY> <VALUE>
```

### Example

터미널에 다음을 입력하세요.

```bash
# set1 {2, 3} 생성
redis:6379> SADD set1 2 3
(integer) 2

# set1에 2가 있는지 확인
redis:6379> SISMEMBER set1 2
# 2가 존재해서 1을 반환
(integer) 1

# set1에 1이 있는지 확인
redis:6379> SISMEMBER set1 1
# 1이 존재하지 않으니 0을 반환
(integer) 0
```


## 08. SMEMBERS key

Redis의 SMEMBERS 명령어는 키에 저장된 셋의 모든 멤버를 가져오는데 사용됩니다.

### Return Value

셋의 모든 멤버를 원소로 하는 배열이 반환됩니다.

### Syntax

SMEMBERS 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SMEMBERS <KEY_NAME>
```

### Example

터미널에 다음을 입력하세요.

```bash
# set1 {1, 2, 3, 4, 5} 생성
redis:6379> SADD set1 1 2 3 4 5
(integer) 5

# SMEMBERS set1의 모든 멤버 확인
redis:6379> SMEMBERS set1
1) "1"
2) "2"
3) "3"
4) "4"
5) "5"
```


## 09. SMOVE source dstination member

Redis의 SMOVE 명령어는 하나의 키에 저장된 셋의 멤버를 다른 셋의 멤버로 이동시키는 명령어입니다. 키가 존재하지 않거나, 원소를 가지고 있지 않으면 이 연산은 실행되지 않고 0을 반환합니다. 그 외에는, source에 해당하는 셋의 멤버는 삭제되고 destination에 해당하는 셋에 멤버가 추가됩니다. destination에 해당하는 셋에 해당 멤버가 존재한다면, source에 해당하는 셋에서 멤버만 삭제됩니다. 키가 만약 셋 타입의 값을 갖고 있지 않다면 에러를 반환합니다.

### Return Value

정수형이 반환됩니다.

* 멤버의 이동이 성공했다면 1이 반환됩니다
* 멤버의 이동이 실패했다면 0이 반환됩니다

### Syntax

SMOVE 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SMOVE <SOURCE_KEY> <DESTINATION_KEY> <MEMBER>
```

### Example

터미널에 다음을 입력하세요.

```bash
# set1 {1, 2, 3, 4, 5} 생성
redis:6379> SADD set1 1 2 3 4 5
(integer) 5

# set2 {2, 3} 생성
redis:6379> SADD set2 2 3
(integer) 2

# 존재하지 않는 키 set4에 연산 실행(실패)
redis:6379> SMOVE set4 set2 0
(integer) 0

# set1에 없는 멤버 연산 실행(실패)
redis:6379> SMOVE set1 set2 6
(integer) 0

# set1에 있는 멤버 연산 실행(성공)
redis:6379> SMOVE set1 set2 1
(integer) 1

# set2 결과 확인
redis:6379> SMEMBERS set2
1) "1"
2) "2"
3) "3"
```


## 10. SPOP key

Redis의 SPOP 명령어는 키에 저장된 셋의 멤버들 중 무작위로 하나 삭제할 때 사용됩니다.

### Return Value

삭제된 원소가 반환되거나, 키가 존재하지 않을 경우, nil이 반환됩니다.

### Syntax

SPOP 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SPOP <KEY>
```

### Example

터미널에 다음을 입력해주세요.

```bash
# set1 {1, 2, 3, 4, 5} 생성
redis:6379> SADD set1 1 2 3 4 5
(integer) 5

# SPOP 수행
redis:6379> SPOP set1
# 무작위로 2가 삭제됨
"2"

# SPOP 연산 결과 확인
redis:6379> SMEMBERS set1
1) "1"
2) "3"
3) "4"
4) "5"
```


## 11. SRANDMEMBER key [count]

### Return Value
### Syntax
### Example

## 12. SREM key member1 [member2 ..]

### Return Value
### Syntax
### Example

## 13. SUNION key1 [key2 ..]

### Return Value
### Syntax
### Example

## 14. SUNIONSTORE destination key1 [key2 ..]

### Return Value
### Syntax
### Example

## 15. SSCAN key cursor [MATCH pattern] [COUNT count]

### Return Value
### Syntax
### Example