Sorted Sets
==========

Redis의 Sorted Set은 값을 저장하는데 있어서, Redis Set과 유사합니다. 차이점은 모든 멤버가, Score와 연관이 되어 있어서, 가장 작은 점수를 가진 멤버에서 큰 점수를 가진 멤버로 정렬하여 저장한다는 것입니다.

Sorted Set은 O(1)의 멤버를 추가, 제거 존재 유무를 확인할 수 있으며, 최대 2^32-1개만큼 요소를 저장할 수 있습니다.


## Example

```bash
redis 127.0.0.1:6379> ZADD tutorials 1 redis 
(integer) 1 
redis 127.0.0.1:6379> ZADD tutorials 2 mongodb 
(integer) 1 
redis 127.0.0.1:6379> ZADD tutorials 3 mysql 
(integer) 1 

redis 127.0.0.1:6379> ZRANGE tutorials 0 10 WITHSCORES  
1) "redis" 
2) "1" 
3) "mongodb" 
4) "2" 
5) "mysql" 
6) "3" 

redis 127.0.0.1:6379> ZADD tutorials 4 mysql 
(integer) 0 

redis 127.0.0.1:6379> ZRANGE tutorials 0 10 WITHSCORES  
1) "redis" 
2) "1" 
3) "mongodb" 
4) "2" 
5) "mysql" 
6) "4" 
```

위의 예제에서는 Redis의 ZADD 명령어를 이용해 "tutorials" 라는 Sorted Set을 만들고, 스코어와 함께 3개의 값들을 저장하였습니다.


## Redis Sorted Sets Commands

| Sr.No | Command | Description |
| ----- | ------- | ----------- |
| 01 | ZADD key score1 member1 [score2 member2] | 하나 이상의 멤버를 Sorted Set에 추가합니다. 이미 존재한다면, 스코어만 갱신됩니다. |
| 02 | ZCARD key | Sorted Set의 개수를 반환합니다. |
| 03 | ZCOUNT key min max | min~max 사이의 스코어를 가진 멤버들의 개수를 반환합니다. |
| 04 | ZINCRBY key increment member | 멤버의 스코어를 증가시킵니다. |
| 05 | ZINTERSTORE destination numkeys key [key ...] | 여러 셋의 교집합을 하나의 키에 저장합니다. |
| 06 | ZLEXCOUNT key min max | 사전 식 범위 사이에 있는 멤버들의 개수를 셉니다. |
| 07 | ZRANGE key start stop [WITHSCORES] | 해당 범위에 존재하는 Sorted Set의 멤버들을 인덱스별로 반환합니다 |
| 08 | ZRANGEBYLEX key min max [LIMIT offset count] | 사전식 범위의 존재하는 Sorted Set의 멤버들을 반환합니다. |
| 09 | ZRANGEBYSCORE key min max [WITHSCORES] [LIMIT] | 스코어 범위에 있는 Sorted Set의 멤버들을 반환합니다. |
| 10 | ZRANK key member | Sorted Set의 멤버의 인덱스를 결정합니다. |
| 11 | ZREM key member [member ...] | Sorted Set에서 하나 이상의 멤버를 삭제합니다. |
| 12 | ZREMRANGEBYLEX key min max | 사전식 범위에 있는 Sorted Set의 모든 멤버를 삭제합니다. |
| 13 | ZREMRANGEBYRANK key start stop | 주어진 인덱스 안에 있는 Sorted Set의 모든 멤버를 삭제합니다. |
| 14 | ZREMRANGEBYSCORE key min max | 주어진 스코어 안에 있는 Sorted Set의 모든 멤버들을 삭제합니다. |
| 15 | ZREVRANGE key start stop [WITHSCORES] | Sorted Set의 멤버들을 반환하며, 인덱스와 함께 스코어 기준 내림차순으로 정렬합니다.  |
| 16 | ZREVRANGEBYSCORE key max min [WITHSCORES] | Sorted Set의 멤버들을 반환하며, 스코어에 의해 내림차순으로 정렬합니다. |
| 17 | ZREVRANK key member | Sorted Set의 멤버들의 인덱스를 결정하며, 스코어 기준 내림차순으로 정렬합니다. |
| 18 | ZSCORE key member | Sorted Set에서 주어진 멤버와 관련된 스코어를 가져옵니다. |
| 19 | ZUNIONSTORE destination numkeys key [key ...] | 여러 Sorted Set의 합집합 결과를 새 키에 저장합니다. |
| 20 | ZSCAN key cursor [MATCH pattern] [COUNT count] | Sorted Set의 스코어와 연관된 요소들을 점진적으로 순회합니다.  |


## 01. ZADD key score1 member1 [score2 member2]

Redis의 ZADD 명령어는 키에 저장된 sorted set에 특정 점수와 함께 멤버들을 추가할 때 사용됩니다. 특정 다수의 스코어/멤버 쌍으로 저장하는 것이 가능합니다. 만약 sorted set에 멤버가 존재한다면, 스코어만 업데이트하여, 정렬 순서에 맞게 재삽입합니다. 키가 존재하지 않을 경우, sorted set이 새로 만들어지며 그 빈 셋에 멤버를 삽입합니다. 키가 존재하나, sorted set이 아닐 경우 에러를 반환합니다.

### Return Value

정수가 반환됩니다. 이 정수는, sorted set의 추가된 원소들의 개수이며, score가 업데이트 된 경우, 개수에 포함되지 않습니다.

### Syntax

ZADD 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZADD <KEY> <SCORE 1> <VALUE 1> [ <SCORE 2> <VALUE2> ...]
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 1-"hello" 추가
redis:6379> ZADD myset 1 "hello"
(integer) 1

# myset 3-"hello" 추가 "hello"는 있으므로 스코어만 업데이트
redis:6379> ZADD myset 3 "hello"
# 그래서 추가 개수로 치지 않아 0
(integer) 0

# 2-"Redis" 3-"Tutorial" 추가
redis:6379> ZADD myset 2 "Redis" 3 "Tutorial"
(integer) 2

# myset 처음부터 끝까지 스코어와 함께 출력
redis:6379> ZRANGE myset 0 -1 WITHSCORES
1) "Redis"
2) "2"
3) "Tutorial"
4) "3"
5) "hello"
6) "3"
```


## 02. ZCARD key

Redis의 ZCARD 명령어는 키에 저장된 sorted set의 개수를 반환합니다.

### Return Value

sorted set이 가지고 있는 원소의 개수가 반환됩니다. 키가 존재하지 않다면, 0을 반환합니다.

### Syntax

ZCARD 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZCARD <KEY>
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 원소 3개 추가
redis:6379> ZADD myset 1 "hello" 2 "Redis" 3 "Tutorial"
(integer) 3

# myset 개수 반환
redis:6379> ZCARD myset
(integer) 3
```


## 03. ZCOUNT key min max

Redis의 ZCOUNT 명령어는 키에 저장된 sorted set의 원소들 중 min과 max 사이의 스코어를 가진 원소들의 개수를 반환합니다.

### Return Value

스코어 범위 안에 있는 원소들의 개수를 반환합니다.

### Syntax

ZCOUNT 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZCOUNT <KEY> <MIN> <MAX>
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 생성
redis:6379> ZADD myset 1 "Hello" 2 "Redis" 3 "Tutorial"
(integer) 3

# 스코어 2 ~ 3 인 원소들의 개수 반환
redis:6379> ZCOUNT myset 2 3
(integer) 2
```

## 04. ZINCRBY key increment member

### Return Value

Redis의 ZINCRBY 명령어는 키에 저장된 sorted set의 멤버의 스코어를 증가시킵니다. 만약 셋에 멤버가 없다면, 스코어 0에 멤버를 저장한 후, 스코어를 증가시킵니다. 키가 존재하지 않는다면, 빈 셋의 멤버를 만들고, 멤버를 만듭니다. 키에 저장된 것이 sorted set이 아니라면, 에러를 반환합니다.

### Syntax

ZINCRBY 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> ZINCRBY <KEY> <INCREMENT> <MEMBER>
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 생성
redis:6379> ZADD myset 1 Hello 2 Redis 3 Tutorial
(integer) 3

# myset 확인
redis:6379> ZRANGE myset 0 -1 WITHSCORES
1) "Hello"
2) "1"
3) "Redis"
4) "2"
5) "Tutorial"
6) "3"

# myset tutorial 스코어 2 증가
redis:6379> ZINCRBY myset 2 Tutorial
"5"

# 연산 결과 확인
redis:6379> ZRANGE myset 0 -1 WITHSCORES
1) "Hello"
2) "1"
3) "Redis"
4) "2"
5) "Tutorial"
6) "5"
```

## 05. ZINTERSTORE destination numkeys key [key ...]

Redis의 ZINTERSTORE 명령어는 주어진 sorted set의 교집합을 destination에 저장할 때 사용됩니다. 이때, 입력 키들을 전달하기 전에 키들의 개수 numkeys를 전달해야 합니다.

### Return Value

sorted set들의 교집합인 destination의 원소들의 개수를 반환합니다.

### Syntax

ZINTESTORE 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> ZINTERSTORE <DESTINATION KEY> <NUMKEY> <KEY 1> .. <KEY N> [WEIGHT ..]
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 생성
redis:6379> ZADD myset 1 Hello 2 Redis 3 Tutorial
(integer) 3

# myset2 생성
redis:6379> ZADD myset2 1 Hell 2 Redis 3 Fuck
(integer) 3

# 교집합 myset n myset2 = myset3
redis:6379> ZINTERSTORE myset3 2 myset myset2
(integer) 1

# myset3 확인
redis:6379> ZRANGE myset3 0 -1 WITHSCORES
1) "Redis"
2) "4"
```


## 06. ZLEXCOUNT key min max

Redis는 ZLEXCOUNT 명령어는 키에 저장된 sorted set의 모든 요소가 동일한 점수로 삽입되었을 때, 요소들을 사전 순서로 정렬시키며, sorted set의 요소들 중 최소값과 최대값 사이의 요소들의 개수를 리턴합니다.

### Return Value

특정 스코어 범위에 존재하는 요소들의 개수를 반환합니다.

### Syntax

ZLEXCOUNT 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> ZLEXCOUNT <KEY> <MIN> <MAX>
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 0 b 0 c 0 d 0 e 0 f 0 g
(integer) 7

# myset 출력
redis:6379> ZRANGE myset 0 -1 WITHSCORES
 1) "a"
 2) "0"
 3) "b"
 4) "0"
 5) "c"
 6) "0"
 7) "d"
 8) "0"
 9) "e"
10) "0"
11) "f"
12) "0"
13) "g"
14) "0"

# b-f 범위의 요소 개수 판단
redis:6379> ZLEXCOUNT myset [b [f
(integer) 5
```


## 07. ZRANGE key start stop [WITHSCORES]

Redis의 ZRANGE 명령어는, 키에 저장된 sorted set에서 특정 범위의 요소들을 가져옵니다. 그 요소들은 오름차순으로 정렬되어있다고, 간주합니다. 사전식 순서는, 같은 스코어의 경우 사용됩니다. start, stop은 인덱스로써 0부터 시작하며 0이 첫번째 원소, 1이 두번째 원소의 인덱스를 표현합니다. 또한, 음수 인덱스도 지원하며 -1은 가장 마지막 원소, -2는 마지막에서 두번째 원소의 인덱스를 표현합니다.

### Return Value

특정 범위 안의 요소들, 배열이 반환됩니다.

### Syntax

ZRANGE 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> ZRANGE <KEY> <START> <STOP> [WITHSCORES]
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 0 b 0 c 0 d 0 e 0 f 0 g
(integer) 7

# myset 출력 0에서 -1(끝)까지 점수와 함께
redis:6379> ZRANGE myset 0 -1 WITHSCORES
 1) "a"
 2) "0"
 3) "b"
 4) "0"
 5) "c"
 6) "0"
 7) "d"
 8) "0"
 9) "e"
10) "0"
11) "f"
12) "0"
13) "g"
14) "0"
```


## 08. ZRANGEBYLEX key min max [LIMIT offset count]

Redis의 ZRANGEBYLEX 명령어는 키에 저장된 sorted set의 요소들 중 특정 범위의 요소들을 반환합니다. 그 요소들은 오름차순으로 정렬되어 있다고 간주합니다. 사전식 순서는, 같은 스코어의 경우 사용됩니다. start, stop은 인덱스로써 0부터 시작하며 0이 첫번째 원소, 1이 두번째 원소의 인덱스를 표현합니다. 또한, 음수 인덱스도 지원하며 -1은 가장 마지막 원소, -2는 마지막에서 두번째 원소의 인덱스를 표현합니다.

### Return Value

특정 스코어 범위에 있는 요소들의 배열이 반환됩니다.

### Syntax

ZRANGEBYLEX 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> ZRANGEBYLEX <KEY> <MIN> <MAX> [LIMIT OFFSET COUNT]
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 0 b 0 c 0 d 0 e 0 f 0 g
(integer) 7

# myset 멤버는 c 이하까지
redis:6379> ZRANGEBYLEX myset - [c
1) "a"
2) "b"
3) "c"

# myset 멤버는 c 미만까지
redis:6379> ZRANGEBYLEX myset - (c
1) "a"
2) "b"
```


## 09. ZRANGEBYSCORE key min max [WITHSCORES] [LIMIT]

Redis의 ZRANGEBYSCORE 명령어는 키에 저장된 sorted set의 min과 max 사이의 모든 원소들을 반환합니다. 그 요소들은 오름차순으로 정렬되어 있다고 간주합니다. 사전식 순서는, 같은 스코어의 경우 사용됩니다. start, stop은 인덱스로써 0부터 시작하며 0이 첫번째 원소, 1이 두번째 원소의 인덱스를 표현합니다. 또한, 음수 인덱스도 지원하며 -1은 가장 마지막 원소, -2는 마지막에서 두번째 원소의 인덱스를 표현합니다.

### Return Value

특정 스코어 범위의 있는 모든 원소들의 배열을 반환합니다.

### Syntax

```
redis:6379> ZRANGEBYSCORE <KEY> <MIN> <MAX> [WITHSCORES] [LIMIT OFFSET COUNT]
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# 스코어 1~3까지 모든 요소 가져오기 
redis:6379> ZRANGEBYSCORE myset 1 3
1) "b"
2) "c"
3) "d"
```


## 10. ZRANK key member

Redis의 ZRANK 명령어는 키에 저장된 sorted set의 멤버의 랭크를 반환하는데 쓰입니다. 만약, 같은 스코어를 지녔다면 사전 순으로 랭크를 매깁니다. 랭크는 0부터 시작하며, 이것은 가장 낮은 스코어는 랭크 0를 뜻합니다.

### Return Value

* 만약 sorted set에 멤버가 있다면, 멤버의 rank를 반환합니다.
* 만약 sorted set에 멤버가 없거나 키가 존재하지 않는다면 nil을 반환합니다.

### Syntax

ZRANK 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZRANK <KEY> <MEMBER>
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# c 랭크 확인
redis:6379> ZRANK myset c
(integer) 2
```


## 11. ZREM key member [member ...]

Redis의 ZREM 명령어는 키에 저장된 sorted set에 특정 멤버를 삭제할 때 쓰입니다. 존재하지 않은 멤버라면 무시됩니다. 키에 sorted set 타입이 저장되어 있지 않다면, 에러를 반환합니다.

### Return Value

sorted set으로부터 삭제된 멤버의 개수를 반환합니다. 존재하지 않는 멤버는 포함되지 않습니다.

### Syntax

ZREM 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZREM <KEY> <MEMBER 1> [<MEMBER 2> ...]
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# a 삭제 시도 (성공)
redis:6379> ZREM myset a
# a 1개만 지우므로 1 반환 
(integer) 1

# a 삭제 시도 (실패)
redis:6379> ZREM myset a
# a 가없으니 무시됨 0 반환
(integer) 0

# b, g, z 삭제
redis:6379> ZREM myset b g z
# b, g 삭제 2개 (z는 없으므로 치지 않음)
(integer) 2
```

## 12. ZREMRANGEBYLEX key min max

Redis의 ZREMRANGEBYLEX는 특정 키에 저장된 sorted set에서 사전식 범위, min과 max 사이에 있는 모든 원소들을 삭제합니다.

### Return Value

삭제된 요소들의 개수를 반환합니다.

### Syntax

ZREMRANGEBYLEX 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZREMRANGEBYLEX <KEY> <MIN> <MAX>
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# myset 확인
redis:6379> ZRANGE myset 0 -1
1) "a"
2) "b"
3) "c"
4) "qwe"
5) "d"
6) "e"
7) "f"
8) "g"

# a ~ b 멤버 삭제
redis:6379> ZREMRANGEBYLEX myset [a [b
(integer) 2

# myset 확인
redis:6379> ZRANGE myset 0 -1
1) "c"
2) "qwe"
3) "d"
4) "e"
5) "f"
6) "g"
```

## 13. ZREMRANGEBYRANK key start stop

Redis의 ZREMRANGEBYRANK 명령어는 키에 저장된 sorted set에 대해서 랭크를 기준으로 start~stop 사이의 모든 요소들을 삭제합니다. start, stop은 인덱스로써 0부터 시작하며 0이 첫번째 원소, 1이 두번째 원소의 인덱스를 표현합니다. 또한, 음수 인덱스도 지원하며 -1은 가장 마지막 원소, -2는 마지막에서 두번째 원소의 인덱스를 표현합니다.

### Return Value

제거된 요소의 개수를 반환합니다.

### Syntax

ZREMRANGEBYRANK 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZREMRANGEBYRANK <KEY> <START> <STOP>
```

### Example

터미널에서 다음을 입력해주세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# rank 0~3까지 삭제 
redis:6379> ZREMRANGEBYRANK myset 0 3
(integer) 4

# 확인
redis:6379> ZRANGE myset 0 -1
1) "e"
2) "f"
3) "g"
```


## 14. ZREMRANGEBYSCORE key min max

Redis의 ZREMRANGEBYSCORE 명령어는 키에 저장된 sorted set에 대해, 스코어를 기준으로 min에서 max 사이의 모든 요소들을 삭제합니다.

### Return Value

삭제된 모든 요소들의 개수를 반환합니다.

### Syntax

ZREMRANGEBYSCORE 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZREMRANGEBYSCORE <KEY> <MIN> <MAX>
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# myset에서 스코어 3~5 요소들 삭제
redis:6379> ZREMRANGEBYSCORE myset 3 5
(integer) 3

# myset 확인
redis:6379> ZRANGE myset 0 -1 WITHSCORES
1) "a"
2) "0"
3) "b"
4) "1"
5) "c"
6) "2"
7) "g"
8) "6"
```

## 15. ZREVRANGE key start stop [WITHSCORES]

Redis의 ZREVRANGE 명령어는 키에 저장된 sorted set의 특정 범위의 요소들을 반환합니다. 요소들은 내림차순으로 정렬되어있다고 간주됩니다. 같은 스코어의 요소들은 사전순으로 내림차순으로 정렬됩니다.

### Return Value

특정 범위의 요소들의 배열이 반환됩니다.

### Syntax

ZREVRANGE 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZREVRANGE <KEY> <MIN> <MAX>
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# ZREVRANGE 실행 역순으로 출력.
redis:6379> ZREVRANGE myset 0 -1
1) "g"
2) "f"
3) "e"
4) "d"
5) "c"
6) "b"
7) "a"
```


## 16. ZREVRANGEBYSCORE key max min [WITHSCORES]

Redis의 ZREVRANGEBYSCORE 명령어는 키에 저장된 sorted set에 대해서 score 기준 max와 min 사이의 모든 요소들을 역순으로 반환합니다. 기본적으로 sorted set의 순서와 달리 이 명령어는 요소들이 내림차순으로 정렬되어있다고 간주합니다. 같은 스코어의 요소라면, 사전순으로 역순으로 정렬됩니다.

### Return Value

특정 스코어 범위의 요소들의 배열이 반환됩니다.

### Syntax

ZREVRANGEBYSCORE 명령어는 다음의 문법 구조를 가집니다.

```
redis:6379> ZREVRANGEBYSCORE <KEY> <MAX> <MIN> [WITHSCORES] [LIMIT offset count]
```

### Example

터미널에 다음을 입력해주세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# score 기준 역순 출력
redis:6379> ZREVRANGEBYSCORE myset +inf -inf
1) "g"
2) "f"
3) "e"
4) "d"
5) "c"
6) "b"
7) "a"
```


## 17. ZREVRANK key member

Redis의 ZREVRANGK 명령어는 키에 저장된 sorted set의 멤버들의 랭크를 역순으로 반환합니다. 즉 이 명령어로 얻은 랭크는 스코어가 높을수록 낮습니다. 랭크는 0부터 시작하며, 이는 가장 높은 랭크가 0임을 뜻합니다.

### Return Value

* sorted set에 멤버가 있을 경우, 그 멤버의 랭크를 반환합니다. 
* sorted set에 멤버가 없거나, 키가 존재하지 않을 경우, nil을 반환합니다.

### Syntax

ZREVRANK 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZREVRANK <KEY> <MEMBER>
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# myset 확인
redis:6379> ZRANGE myset 0 -1 WITHSCORES
 1) "a"
 2) "0"
 3) "b"
 4) "1"
 5) "c"
 6) "2"
 7) "d"
 8) "3"
 9) "e"
10) "4"
11) "f"
12) "5"
13) "g"
14) "6"

# a 랭크 확인
redis:6379> ZREVRANK myset a
# a 의 스코어는 0 따라서 랭크는 6
(integer) 6

# g 랭크 확인
redis:6379> ZREVRANK myset g
# g의 스코어는 6 따라서 랭크는 0
(integer) 0
```

## 18. ZSCORE key member

Redis의 ZSCORE 명령어는 키에 저장된 sorted set에 멤버의 스코어를 반환합니다. 멤버가 존재하지 않거나, 키가 존재하지 않을 경우 nil을 반환합니다.

### Return Value

멤버의 스코어가 반환됩니다.

### Syntax

ZSCORE 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZSCORE <KEY> <MEMBER>
```

### Example

터미널에 다음을 입력해주세요.

```bash
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# myset 확인
redis:6379> ZRANGE myset 0 -1 WITHSCORES
 1) "a"
 2) "0"
 3) "b"
 4) "1"
 5) "c"
 6) "2"
 7) "d"
 8) "3"
 9) "e"
10) "4"
11) "f"
12) "5"
13) "g"
14) "6"

# a 스코어 확인
redis:6379> ZSCORE myset a
"0"

# g 스코어 확인
redis:6379> ZSCORE myset g
"6"
```


## 19. ZUNIONSTORE destination numkeys key [key ...]

Redis의 ZUNIONSTORE 명령어는 주어진 numkey 만큼 sorted set의 키들을 받아 합집합을 만들고, destination에 그 결과를 저장합니다. 입력 키와를 전달하기 전에 선택적으로, WEIGHTS, AGGREGATE 등 다른 인수를 전달할 수 있습니다.

### Return Value

셋들의 합집합 결과인 destination의 원소의 개수가 반환됩니다.

### Syntax

ZUNIONSTORE 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZUNIONSTORE <DESTINATION_KEY> <NUMKEYS> <KEY 1> .. <KEY N> [WEIGHTS weight [weight ...]] [AGGREGATE SUN|MIN|MAX]
```

### Example

```bash
# myset 초기화
redis:6379> ZADD myset 0 a 1 b 2 c 3 d 4 e 5 f 6 g
(integer) 7

# myset2 초기화
redis:6379> ZADD myset2 1 z 2 c 3 d 5 q
(integer) 4

# ZUNIONSTORE 연산
redis:6379> ZUNIONSTORE myset3 2 myset1 myset2 WEIGHTS 2 3
(integer) 4

# ZUNIONSTORE 결과
redis:6379> ZRANGE myset3 0 -1 WITHSCORES
1) "z"
2) "3"
3) "c"
4) "6"
5) "d"
6) "9"
7) "q"
8) "15"
```


## 20. ZSCAN key cursor [MATCH pattern] [COUNT count]     

Redis의 ZSCAN 명령어는 스코어와 연관된 sorted set의 원소들을 순회할 때 사용됩니다.

### Return Value

배열이 반환됩니다.

### Syntax

ZSCAN 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> ZSCAN <KEY> <CURSOR> [MATCH pattern] [COUNT count] 
```

### Example

-

[HyperLogLog](./ch13.md)에서 계속됩니다.