Sets
==========

Redis의 Set 타입은, 유니크한 문자열의 집합입니다. 여기서 "유니크 하다"란 같은 키의 중복을 허용하지 않는다라는 뜻입니다. Redis의 Set은 add, remove, 존재 유무 확인을 O(1) 즉 상수 시간에 처리할 수 있습니다. Set이 저장할 수 있는 최대 원소의 개수는 2^32-1개입니다.

## Example

터미널에 다음을 입력하세요.

```bash
# set1 키에 Set을 만들고 redis 저장
redis:6379> SADD set1 redis
(integer) 1

# set1에 mongo 저장
redis:6379> SADD set1 mongo
(integer) 1

# set1에 mysql 저장
redis:6379> SADD set1 mysql
(integer) 1

# set1에 mysql 저장
redis:6379> SADD set1 mysql
# 실패 이미 저장하고 있기 때문에.
(integer) 0

# 값 확인
redis:6379> SMEMBERS set1
1) "mysql"
2) "redis"
3) "mongo"
```

위 예제는 Redis Set의 SADD 해서 원소를 추가하고, SMEMBERS를 통해 원소들을 확인하는 내용입니다.


## Redis Sets Commands

| Sr.No | Command | Description |
| ----- | ------- | ----------- |
| 01 | SADD key member1 [member2 ..] | 셋의 하나 이상의 멤버를 추가합니다. |
| 02 | SCARD key | 셋의 멤버의 개수를 반환합니다. |
| 03 | SDIFF key1 [key2 ..] | 여러 셋의 차집합을 구합니다. |
| 04 | SDIFFSTORE destination key1 [key2 ..] | 여러 셋의 차집합을 구한 뒤 한 키에 저장합니다. |
| 05 | SINTER key1 [key2 ..] | 여러 셋의 교집합을 구합니다. |
| 06 | SINTERSTORE destination key1 [key2 ..] | 여러 셋의 교집합을 구한 뒤 한 키에 저장합니다. |
| 07 | SISMEMBER key member | 셋의 멤버인지 확인합니다. |
| 08 | SMEMBERS key | 셋의 멤버들을 가져옵니다. |
| 09 | SMOVE source dstination member | 하나의 셋에서 다른 셋으로 멤버를 이동합니다. |
| 10 | SPOP key | 셋에서 무작위로 멤버 하나를 삭제합니다. |
| 11 | SRANDMEMBER key [count] | 셋에서 무작위로 여러 멤버를 가져옵니다. |
| 12 | SREM key member1 [member2 ..] | 셋에서 하나 이상의 멤버를 삭제합니다. |
| 13 | SUNION key1 [key2 ..] | 여러 셋의 합집합을 구합니다. |
| 14 | SUNIONSTORE destination key1 [key2 ..] | 여러 셋의 합집합을 구한 뒤 한 키에 저장합니다. |
| 15 | SSCAN key cursor [MATCH pattern] [COUNT count] | 세트의 요소들을 점진적으로 반복합니다. |


## 01. SADD key member1 [member2 ..] 

Redis에서 SADD 명령어는 키에 저장된 셋에서 멤버를 추가할 때 사용됩니다. 만약 멤버가 존재한다면, 이것은 무시됩니다. 키가 존재하지 않는다면, 새로운 셋이 만들어지고, 멤버를 추가합니다. 셋이 아닌 값을 저장하는 키라면, 에러를 반환합니다.

### Return Value

정수가 반환됩니다. 셋에 추가되면 1, 아니라면 0을 반환합니다.

### Syntax

SADD 명령어는 다음의 문법 구조를 가지고 있습니다.

```
redis:6379> SADD <KEY_NAME> <VALUE1> [<VALUE2> ..]
```

### Example

터미널에 다음을 입력하세요.

```bash
# myset 셋 생성 후 redis 추가
redis:6379> SADD myset redis
(integer) 1

# myset에 mongo 추가
redis:6379> SADD myset mongo
(integer) 1

# myset에 mongo 추가 (실패)
redis:6379> SADD myset mongo
# 0 - 이미 있는 멤버라 추가되지 않음을 나타냄
(integer) 0

# myset에 저장되어 있는 모든 멤버 확인
redis:6379> SMEMBERS myset
1) "redis"
2) "mongo"
```


## 02. SCARD key

Redis의 SCARD 명령어는 Set에 저장되어 있는 원소들의 개수를 반환하는데 사용됩니다.

### Return Value

Set의 개수가 반환됩니다. 만약 존재하지 않은 키라면 0이 반환됩니다.

### Syntax

SCARD 명령어는 다음 문법 구조를 가지고 있습니다.

```
redis:6379> SCARD <KEY_NAME>
```

### Example

```bash
# 셋에 멤버 2개 추가
redis:6379> SADD myset hello
(integer) 1
redis:6379> SADD myset foo
(integer) 1

# 셋 개수 확인
redis:6379> SCARD myset
(integer) 2
```


## 03. SDIFF key1 [key2 ..]

### Return Value
### Syntax
### Example

## 04. SDIFFSTORE destination key1 [key2 ..]

### Return Value
### Syntax
### Example

## 05. SINTER key1 [key2 ..]

### Return Value
### Syntax
### Example

## 06. SINTERSTORE destination key1 [key2 ..]

### Return Value
### Syntax
### Example

## 07. SISMEMBER key member

### Return Value
### Syntax
### Example

## 08. SMEMBERS key

### Return Value
### Syntax
### Example

## 09. SMOVE source dstination member

### Return Value
### Syntax
### Example

## 10. SPOP key

### Return Value
### Syntax
### Example

## 11. SRANDMEMBER key [count]

### Return Value
### Syntax
### Example

## 12. SREM key member1 [member2 ..]

### Return Value
### Syntax
### Example

## 13. SUNION key1 [key2 ..]

### Return Value
### Syntax
### Example

## 14. SUNIONSTORE destination key1 [key2 ..]

### Return Value
### Syntax
### Example

## 15. SSCAN key cursor [MATCH pattern] [COUNT count]

### Return Value
### Syntax
### Example